trunk/dev/sastrerias/app/controllers/admin/cliente_controller.rb

  def create
    @cliente=Cliente.new(params[:cliente])
    if @cliente.save
---
INSERT INTO `clientes` (`updated_at`, `nombre`, `created_at`) VALUES('2009-04-10 21:47:56', '1', '2009-04-10 21:47:56')

  def update
    @cliente=Cliente.find(params[:id])
    if @cliente.update_attributes(params[:cliente])
---
SELECT * FROM `clientes` WHERE (`clientes`.`id` = 14)
UPDATE `clientes` SET `nombre` = 'Rudi', `updated_at` = '2009-04-11 18:20:51' WHERE `id` = 14

  def edit
    @cliente=Cliente.find(params[:id])
---
SELECT * FROM `clientes` WHERE (`clientes`.`id` = 1)